#include "Arknights.h"
int main()
{
	char* name[MAX] = { "阿","艾丽妮","艾雅法拉","安洁莉娜","白铁", "百炼嘉维尔","陈","澄闪","斥罪","仇白" ,"纯烬艾雅法拉" ,"伺夜" ,"淬羽赫默" ,"嵯峨" ,"涤火杰西卡" ,"多萝西" ,"菲亚梅塔" ,"风笛" ,"歌蕾蒂娅" ,"归溟幽灵鲨" ,"傀影" ,"号角" ,"赫德雷" ,"赫拉格" ,"黑" ,"黑键" ,"鸿雪" ,"煌" ,"灰烬" ,"霍尔海雅" ,"棘刺" ,"假日威龙陈" ,"缄默德克萨斯" ,"锏" ,"卡涅利安" ,"凯尔希" ,"刻俄柏" ,"空弦" ,"老鲤" ,"林" ,"琳琅诗怀雅" ,"灵知" ,"铃兰" ,"令" ,"流明" ,"玛恩纳" ,"麦哲伦" ,"迷迭香" ,"莫斯提马" ,"缪尔赛思" ,"能天使" ,"泥岩" ,"年" ,"帕拉斯" ,"麒麟R夜刀" ,"琴柳" ,"塞雷娅" ,"森蚺" ,"山" ,"闪灵" ,"圣约送葬人" ,"史尔特尔" ,"水月" ,"斯卡蒂" ,"塑心" ,"提丰" ,"推进之王" ,"薇薇安娜" ,"温蒂" ,"夕" ,"瑕光" ,"星熊" ,"焰尾" ,"焰影苇草" ,"耀骑士临光" ,"夜莺" ,"伊芙利特" ,"伊内丝" ,"异客" ,"银灰" ,"远牙" ,"早露" ,"止颂" ,"重岳" ,"浊心斯卡蒂" ,"W" };
	int mark[MAX] = { 0 };
	int count[MAX] = { 0 };
	WinRate winRate[MAX];
	for (int i = 0; i < MAX; i++)
	{
		winRate[i].index = i;
	}
	Voke(name, mark, count);
	Rank(name, mark, count, winRate);
	PrintSort(name, winRate, count);
	system("pause");
	return 0;
}